<a href="https://colab.research.google.com/github/banduguide/InsaidTelecomData/blob/master/CapstoneProject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
! pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/d8/29/45c72a2292011816aab7f73e778872e79573a2ecc897592f7119ed802a82/mysql_connector_python-8.0.19-cp36-cp36m-manylinux1_x86_64.whl (14.7MB)
     |████████████████████████████████| 14.7MB 296kB/s
Collecting protobuf==3.6.1
  Downloading https://files.pythonhosted.org/packages/c2/f9/28787754923612ca9bfdffc588daa05580ed70698add063a5629d1a4209d/protobuf-3.6.1-cp36-cp36m-manylinux1_x86_64.whl (1.1MB)
     |████████████████████████████████| 1.1MB 33.8MB/s
Collecting dnspython==1.16.0
  Downloading https://files.pythonhosted.org/packages/ec/d3/3aa0e7213ef72b8585747aa0e271a9523e713813b9a20177ebe1e939deb0/dnspython-1.16.0-py2.py3-none-any.whl (188kB)
     |████████████████████████████████| 194kB 43.7MB/s
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (1.12.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (45.1.0)
ERROR: tensorflow-metadata 0.21.1 has requirement protobuf<4,>=3.7, but you'll have protobuf 3.6.1 which is incompatible.
Installing collected packages: protobuf, dnspython, mysql-connector-python
  Found existing installation: protobuf 3.10.0
    Uninstalling protobuf-3.10.0:
      Successfully uninstalled protobuf-3.10.0
Successfully installed dnspython-1.16.0 mysql-connector-python-8.0.19 protobuf-3.6.1

In [0]:
from google.colab import auth
auth.authenticate_user()

from pydrive.drive import GoogleDrive
from pydrive.auth import GoogleAuth
from oauth2client.client import GoogleCredentials
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

myfile = drive.CreateFile({'id': '1pnFGD8DjwrEvUCt_Oc7QsNQ62fLdBHLj'})
myfile.GetContentFile('data_event.csv')

In [0]:
import pandas as pd
event_data = pd.read_csv('data_event.csv')

In [0]:
event_data.head()

   event_id     device_id            timestamp  ...  latitude   city  state
0       1.0  2.918269e+16  2016-05-01 00:55:25  ...  28.68161  Delhi  Delhi
1    7104.0  2.918269e+16  2016-05-02 09:37:02  ...  28.68161  Delhi  Delhi
2   29661.0  2.918269e+16  2016-05-04 00:56:04  ...  28.68161  Delhi  Delhi
3   33133.0  2.918269e+16  2016-05-06 05:01:15  ...  28.68161  Delhi  Delhi
4   38980.0  2.918269e+16  2016-05-06 09:55:04  ...  28.68161  Delhi  Delhi

[5 rows x 7 columns]

In [0]:
event_data.shape

(3252950, 7)

In [0]:
event_data.describe(include='all')

            event_id     device_id  ...     city    state
count   3.252950e+06  3.252497e+06  ...  3252950  3252573
unique           NaN           NaN  ...      933       32
top              NaN           NaN  ...    Delhi    Delhi
freq             NaN           NaN  ...   744276   751733
mean    1.626476e+06  1.012200e+17  ...      NaN      NaN
std     9.390459e+05  5.316758e+18  ...      NaN      NaN
min     1.000000e+00 -9.222957e+18  ...      NaN      NaN
25%     8.132382e+05 -4.540611e+18  ...      NaN      NaN
50%     1.626476e+06  1.726820e+17  ...      NaN      NaN
75%     2.439713e+06  4.861813e+18  ...      NaN      NaN
max     3.252950e+06  9.222849e+18  ...      NaN      NaN

[11 rows x 7 columns]

In [0]:
import mysql.connector
from mysql.connector import errorcode
from pandas import DataFrame


config = {
  'user': 'student',
  'password': 'student',
  'host': 'cpanel.insaid.co',
  'database': 'Capstone1',
  'raise_on_warnings': True
}


try:
  cnx = mysql.connector.connect(**config)
  print("success",cnx)
  gender_age_train_querystr = "select * from gender_age_train "
  phone_brand_device_model_querystr =   "select * from phone_brand_device_model "
  cursor = cnx.cursor()
  cursor.execute(gender_age_train_querystr)
  gender_age_train =pd.DataFrame(cursor.fetchall(), columns=['device_id','gender','age','age_group'])

  cursor.execute(phone_brand_device_model_querystr)
  phone_brand_device_model = pd.DataFrame(cursor.fetchall(), columns=['device_id','brand','phone_brand'])


except mysql.connector.Error as err:
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  else:
    print(err)

else:
  cnx.close()

success <mysql.connector.connection_cext.CMySQLConnection object at 0x7f2597fdbb38>

In [0]:
gender_age_train.head()

             device_id gender  age age_group
0 -8076087639492063270      M   35    M32-38
1 -2897161552818060146      M   35    M32-38
2 -8260683887967679142      M   35    M32-38
3 -4938849341048082022      M   30    M29-31
4   245133531816851882      M   30    M29-31

In [0]:
gender_age_train.shape

(74645, 4)

In [0]:
gender_age_train.describe(include='all')

           device_id gender           age age_group
count   7.464500e+04  74645  74645.000000     74645
unique           NaN      2           NaN        12
top              NaN      M           NaN    M23-26
freq             NaN  47904           NaN      9605
mean   -7.491354e+14    NaN     31.410342       NaN
std     5.327150e+18    NaN      9.868735       NaN
min    -9.223067e+18    NaN      1.000000       NaN
25%    -4.617367e+18    NaN     25.000000       NaN
50%    -1.841362e+16    NaN     29.000000       NaN
75%     4.636656e+18    NaN     36.000000       NaN
max     9.222849e+18    NaN     96.000000       NaN

In [0]:
phone_brand_device_model.head()

             device_id brand phone_brand
0  1877775838486905855  vivo         Y13
1 -3766087376657242966    小米        V183
2 -6238937574958215831  OPPO         R7s
3  8973197758510677470    三星       A368t
4 -2015528097870762664    小米     红米Note2

In [0]:
phone_brand_device_model.shape

(87726, 3)

In [0]:
phone_brand_device_model.describe(include='all')

           device_id  brand phone_brand
count   8.772600e+04  87726       87726
unique           NaN    116        1467
top              NaN     小米      红米note
freq             NaN  21645        3500
mean   -5.212557e+15    NaN         NaN
std     5.330157e+18    NaN         NaN
min    -9.223322e+18    NaN         NaN
25%    -4.623331e+18    NaN         NaN
50%    -3.109802e+16    NaN         NaN
75%     4.635194e+18    NaN         NaN
max     9.222849e+18    NaN         NaN

In [0]:
gender_age_phone_brand_device_model_df = pd.merge(gender_age_train,phone_brand_device_model, on = 'device_id')

In [0]:
gender_age_phone_brand_device_model_df.describe(include='all')

           device_id gender           age age_group  brand phone_brand
count   7.461700e+04  74617  74617.000000     74617  74617       74617
unique           NaN      2           NaN        12    111        1427
top              NaN      M           NaN    M23-26     小米      红米note
freq             NaN  47884           NaN      9598  18399        2998
mean   -1.196826e+15    NaN     31.410992       NaN    NaN         NaN
std     5.327107e+18    NaN      9.869512       NaN    NaN         NaN
min    -9.223067e+18    NaN      1.000000       NaN    NaN         NaN
25%    -4.617785e+18    NaN     25.000000       NaN    NaN         NaN
50%    -1.845883e+16    NaN     29.000000       NaN    NaN         NaN
75%     4.635530e+18    NaN     36.000000       NaN    NaN         NaN
max     9.222849e+18    NaN     96.000000       NaN    NaN         NaN

In [0]:
gender_age_phone_brand_device_model_df.shape

(74617, 6)